{"config": [{"config": {"padding": "valid", "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "name": "conv2d_1", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 10, 10, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "name": "conv2d_2", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "name": "conv2d_3", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "units": 64, "name": "dense_1", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "units": 1, "name": "dense_2", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.3", "backend": "tensorflow"}